In [2]:
import numpy as np
import pandas as pd
import datetime

# Cleaning up the data
## Account Data

In [6]:
account_data = pd.read_csv('dataset/account.csv')
# card_data = pd.read_csv('dataset/card.csv')
# client_data = pd.read_csv('dataset/client.csv')
# disp_data = pd.read_csv('dataset/disp.csv')
# district_data = pd.read_csv('dataset/district.csv')
# loan_data = pd.read_csv('dataset/loan.csv')
# order_data = pd.read_csv('dataset/order.csv')
# trans_data = pd.read_csv('dataset/trans.csv')

In [7]:
account_data.head()

   account_id  district_id         frequency    date
0         576           55  POPLATEK MESICNE  930101
1        3818           74  POPLATEK MESICNE  930101
2         704           55  POPLATEK MESICNE  930101
3        2378           16  POPLATEK MESICNE  930101
4        2632           24  POPLATEK MESICNE  930102

In [23]:
pd.set_option("display.max_rows",5)

In [11]:
account_data = account_data.set_index('account_id')

In [12]:
missing = account_data.isnull().sum()
missing

district_id    0
frequency      0
date           0
dtype: int64

In [15]:
account_data.head()

            district_id         frequency    date
account_id
576                  55  POPLATEK MESICNE  930101
3818                 74  POPLATEK MESICNE  930101
704                  55  POPLATEK MESICNE  930101
2378                 16  POPLATEK MESICNE  930101
2632                 24  POPLATEK MESICNE  930102

In [19]:
parsed_date = []
for column in account_data.date:
    parsed_date.append(str(column))

In [28]:
cleanDate = []
for i in parsed_date:
    left,middle,right = i[:2],i[2:4],i[4:]
    joined_data = left+'/'+middle+'/'+right
    cleanDate.append(joined_data)
cleanDate

account_data.date = cleanDate

In [34]:
date = pd.to_datetime(account_data['date'],format="%y/%m/%d")
account_data.date = date

In [35]:
account_data.date

account_id
576    1993-01-01
3818   1993-01-01
          ...
1573   1997-12-29
3276   1997-12-29
Name: date, Length: 4500, dtype: datetime64[ns]

In [36]:
account_data.head()

            district_id         frequency       date
account_id
576                  55  POPLATEK MESICNE 1993-01-01
3818                 74  POPLATEK MESICNE 1993-01-01
704                  55  POPLATEK MESICNE 1993-01-01
2378                 16  POPLATEK MESICNE 1993-01-01
2632                 24  POPLATEK MESICNE 1993-01-02

In [5]:
cleaned_account_data = pd.read_csv('dataset/cleanData/account_data_cleaned.csv')
cleaned_account_data.frequency.unique()

array(['POPLATEK MESICNE', 'POPLATEK PO OBRATU', 'POPLATEK TYDNE'],
      dtype=object)

In [6]:
def parse_frequency(x):
    if x == 'POPLATEK MESICNE':
        return 'MONTHLY'
    if x == 'POPLATEK PO OBRATU':
        return 'TRANSACTION'
    if x == 'POPLATEK TYDNE':
        return 'TRANSACTION'
    else:
        return 'UNKNOWN'

In [7]:
cleaned_account_data['frequency'] = cleaned_account_data['frequency'].map(parse_frequency)

In [8]:
cleaned_account_data.head()

   account_id  district_id frequency        date
0         576           55   MONTHLY  1993-01-01
1        3818           74   MONTHLY  1993-01-01
2         704           55   MONTHLY  1993-01-01
3        2378           16   MONTHLY  1993-01-01
4        2632           24   MONTHLY  1993-01-02

In [11]:
cleaned_account_data.to_csv('dataset/cleanData/account_data_cleaned.csv')

In [46]:
account_data.isna().sum()

district_id    0
frequency      0
date           0
dtype: int64

In [47]:
account_data.isnull().sum()

district_id    0
frequency      0
date           0
dtype: int64

## client data

In [57]:
client_data = pd.read_csv('dataset/client.csv')

In [51]:
client_data.head(
)

   client_id  birth_number  district_id
0          1        706213           18
1          2        450204            1
2          3        406009            1
3          4        561201            5
4          5        605703            5

In [53]:
missing = client_data.isnull().sum()
missing

client_id       0
birth_number    0
district_id     0
dtype: int64

In [54]:
na = client_data.isna().sum()
na

client_id       0
birth_number    0
district_id     0
dtype: int64

In [4]:
def cleanDates(date_column):
    parsed_date = []
    for column in date_column:
        parsed_date.append(str(column))
    cleanDate = []
    for i in parsed_date:
        left,middle,right = i[:2],i[2:4],i[4:6]
        joined_data = left+'/'+middle+'/'+right
        cleanDate.append(joined_data)
    date_column = cleanDate
    date_column = pd.to_datetime(date_column,infer_datetime_format=True)

In [56]:
client_data.set_index('client_id')

           birth_number  district_id
client_id
1                706213           18
2                450204            1
...                 ...          ...
13971            626019           67
13998            535812           74

[5369 rows x 2 columns]

In [48]:
def get_middle_digits(x):
    return str(x)[2:4]

In [38]:
def get_day(x):
    return int(str(x)[4:6])

In [49]:
def get_month(x):
    month = int(get_middle_digits(x))
    if month >50:
        return month -50
    else:
        return month

In [36]:
def get_year(x):
    return int(str(x)[:2])

In [52]:
def get_gender(x):
    month = int(get_middle_digits(x))
    if month > 50:
        return('Female')
    else:
        return('Male')

In [55]:
def parse_Dates(x):
    year = get_year(x) + 1900
    month = get_month(x)
    day = get_day(x)
    return datetime.datetime(year,month,day)

In [58]:
client_data['Date_of_birth'] = client_data['birth_number'].map(parse_Dates)

In [60]:
client_data['Gender'] = client_data['birth_number'].map(get_gender)

In [63]:
client_data = client_data.drop('birth_number',1)

/tmp/ipykernel_74949/2773485492.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  client_data = client_data.drop('birth_number',1)

In [65]:
client_data = client_data.rename(columns={'Date_of_birth':'date_of_birth','Gender':'gender'})

In [66]:
client_data.head()

   client_id  district_id date_of_birth  gender
0          1           18    1970-12-13  Female
1          2            1    1945-02-04    Male
2          3            1    1940-10-09  Female
3          4            5    1956-12-01    Male
4          5            5    1960-07-03  Female

In [76]:
client_data = client_data.set_index('client_id')

In [77]:
client_data.to_csv('dataset/cleanData/client_Data_cleaned.csv')

In [78]:
client_data.head()

           district_id date_of_birth  gender
client_id
1                   18    1970-12-13  Female
2                    1    1945-02-04    Male
3                    1    1940-10-09  Female
4                    5    1956-12-01    Male
5                    5    1960-07-03  Female

In [110]:
def get_age(x):
    today = datetime.datetime.today()
    days=  today-x
    return days.days /365

In [111]:
client_data['age'] = client_data['date_of_birth'].map(get_age)

In [112]:
client_data.head()

           district_id date_of_birth  gender        age
client_id
1                   18    1970-12-13  Female  51.128767
2                    1    1945-02-04    Male  77.000000
3                    1    1940-10-09  Female  81.326027
4                    5    1956-12-01    Male  65.169863
5                    5    1960-07-03  Female  61.580822

In [ ]:
client_data.to_csv('dataset/cleanData/client_Data_cleaned.csv')

## Card Data

In [3]:
card_data = pd.read_csv('dataset/card.csv')
card_data.head()

   card_id  disp_id     type           issued
0     1005     9285  classic  931107 00:00:00
1      104      588  classic  940119 00:00:00
2      747     4915  classic  940205 00:00:00
3       70      439  classic  940208 00:00:00
4      577     3687  classic  940215 00:00:00

In [6]:
cleanDates(card_data.issued)

In [8]:
card_data.issued

0      931107 00:00:00
1      940119 00:00:00
2      940205 00:00:00
3      940208 00:00:00
4      940215 00:00:00
            ...
887    981226 00:00:00
888    981228 00:00:00
889    981228 00:00:00
890    981229 00:00:00
891    981229 00:00:00
Name: issued, Length: 892, dtype: object

In [10]:
new_date_row = cleanDates(card_data.issued)

In [13]:
card_data['issued'] = pd.to_datetime(card_data['issued'].str[:6],format='%y%m%d')

In [14]:
card_data.head()

   card_id  disp_id     type     issued     issues
0     1005     9285  classic 1993-11-07 1993-11-07
1      104      588  classic 1994-01-19 1994-01-19
2      747     4915  classic 1994-02-05 1994-02-05
3       70      439  classic 1994-02-08 1994-02-08
4      577     3687  classic 1994-02-15 1994-02-15

In [23]:
card_data = card_data.drop('issues',1)

/tmp/ipykernel_74949/1384039306.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  card_data = card_data.drop('issues',1)

In [24]:
card_data.isnull().sum()

card_id    0
disp_id    0
type       0
issued     0
dtype: int64

In [68]:
card_data = card_data.rename(columns={'type':'card_type','issued':'date_of_issue'})

In [69]:
card_data.head()

   card_id  disp_id card_type date_of_issue
0     1005     9285   classic    1993-11-07
1      104      588   classic    1994-01-19
2      747     4915   classic    1994-02-05
3       70      439   classic    1994-02-08
4      577     3687   classic    1994-02-15

In [71]:
card_data.set_index('card_id')

         disp_id card_type date_of_issue
card_id
1005        9285   classic    1993-11-07
104          588   classic    1994-01-19
747         4915   classic    1994-02-05
70           439   classic    1994-02-08
577         3687   classic    1994-02-15
...          ...       ...           ...
125          694      gold    1998-12-26
674         4360   classic    1998-12-28
322         2063   classic    1998-12-28
685         4467   classic    1998-12-29
635         4083   classic    1998-12-29

[892 rows x 3 columns]

In [72]:
card_data.to_csv('dataset/cleanData/card_Data_cleaned.csv')

## cleaning the Disp Data

In [12]:
disp_data = pd.read_csv('dataset/disp.csv')

In [13]:
disp_data.head()

   disp_id  client_id  account_id       type
0        1          1           1      OWNER
1        2          2           2      OWNER
2        3          3           2  DISPONENT
3        4          4           3      OWNER
4        5          5           3  DISPONENT

In [14]:
disp_data = disp_data.set_index('disp_id')

In [15]:
disp_data.to_csv('dataset/cleanData/disp_data_cleaned')

In [17]:
disp_data.isna().sum()

client_id     0
account_id    0
type          0
dtype: int64

## cleaning the district data

In [18]:
district_data = pd.read_csv('dataset/district.csv')

In [22]:
district_data.isna().sum()

A1     0
A2     0
A3     0
A4     0
A5     0
A6     0
A7     0
A8     0
A9     0
A10    0
A11    0
A12    0
A13    0
A14    0
A15    0
A16    0
dtype: int64

In [23]:
district_data = district_data.rename(columns={'A1':'district_id','A2':'district_name','A3':'region','A4':'total_inhabitants',
'A5':'num_munipalities_less_499','A6':'500_to_1999','A7':'2000_to_9999','A8':'greater_than_10000','A9':'num_cities','A10':'ratio_urban',
'A11':'avg_salary','A12':'unemp_rate_95','A13':'unemp_rate_96','A14':'enterpreneurs_per_1000','A15':'num_crimes95','A16':'num_crimes96'})

In [29]:
district_data.head()

,district_name,region,total_inhabitants,num_munipalities_less_499,500_to_1999,2000_to_9999,greater_than_10000,num_cities,ratio_urban,avg_salary,unemp_rate_95,unemp_rate_96,enterpreneurs_per_1000,num_crimes95,num_crimes96
district_id,,,,,,,,,,,,,,,
1,Hl.m. Praha,Prague,1204953,0,0,0,1,1,100.0,12541,0.29,0.43,167,85677,99107
2,Benesov,central Bohemia,88884,80,26,6,2,5,46.7,8507,1.67,1.85,132,2159,2674
3,Beroun,central Bohemia,75232,55,26,4,1,5,41.7,8980,1.95,2.21,111,2824,2813
4,Kladno,central Bohemia,149893,63,29,6,2,6,67.4,9753,4.64,5.05,109,5244,5892
5,Kolin,central Bohemia,95616,65,30,4,1,6,51.4,9307,3.85,4.43,118,2616,3040

In [27]:
district_data = district_data.set_index('district_id')

In [28]:
district_data.to_csv('dataset/cleanData/district_data_cleaned.csv')

In [45]:
loan_data = pd.read_csv('dataset/loan.csv')

In [47]:
loan_data = loan_data.rename(columns={'date':'date_of_loan','payments':'monthly_payment','status':'status_code'})

In [32]:
def parse_status(x):
    if x == 'A':
        return 'Contract Finished/No Problems'
    if x == 'B':
        return 'Contract Finished/Not Payed'
    if x == 'C':
        return 'Running Contract/OK'
    if x == 'D':
        return 'Running Contract/Debt'
    else:
        return 'Unknown'

In [48]:
loan_data['status'] = loan_data['status_code'].map(parse_status)

In [51]:
loan_data.head()

,account_id,date_of_loan,amount,duration,monthly_payment,status_code,status
loan_id,,,,,,,
5314,1787,1993-07-05,96396,12,8033.0,B,Contract Finished/Not Payed
5316,1801,1993-07-11,165960,36,4610.0,A,Contract Finished/No Problems
6863,9188,1993-07-28,127080,60,2118.0,A,Contract Finished/No Problems
5325,1843,1993-08-03,105804,36,2939.0,A,Contract Finished/No Problems
7240,11013,1993-09-06,274740,60,4579.0,A,Contract Finished/No Problems

In [50]:
loan_data['date_of_loan'] = pd.to_datetime(loan_data['date_of_loan'],format='%y%m%d')
loan_data= loan_data.set_index('loan_id')

In [52]:
loan_data.to_csv('dataset/cleanData/loan_data_cleaned.csv')

## cleaning Order table

In [53]:
order_data = pd.read_csv('dataset/order.csv')

In [57]:
order_data.head()

   order_id  account_id bank_to  account_to  amount k_symbol
0     29401           1      YZ    87144583  2452.0     SIPO
1     29402           2      ST    89597016  3372.7     UVER
2     29403           2      QR    13943797  7266.0     SIPO
3     29404           3      WX    83084338  1135.0     SIPO
4     29405           3      CD    24485939   327.0

In [59]:
def parse_kSymbol(x):
    if x=='SIPO':
        return 'Household'
    if x=='UVER':
        return 'Loan payment'
    if x == 'LEASING':
        return 'Leasing'
    if x == 'POJISTNE':
        return 'Insurance payment'
    else:
        return 'Unknown'

In [60]:
order_data['k_symbol']=order_data['k_symbol'].map(parse_kSymbol)

In [61]:
order_data = order_data.rename(columns={'bank_to': 'order_recipient_bank',
                              'account_to':'order_recipient_account',
                              'amount':'order_amount',
                              'k_symbol':'order_k_symbol'})

In [62]:
order_data = order_data.set_index('order_id')

In [63]:
order_data.head()

,account_id,order_recipient_bank,order_recipient_account,order_amount,order_k_symbol
order_id,,,,,
29401,1,YZ,87144583,2452.0,Household
29402,2,ST,89597016,3372.7,Loan payment
29403,2,QR,13943797,7266.0,Household
29404,3,WX,83084338,1135.0,Household
29405,3,CD,24485939,327.0,Unknown

In [64]:
order_data.to_csv('dataset/cleanData/order_data_cleaned.csv')

## cleaning transf data

In [69]:
trans_data = pd.read_csv('dataset/trans.csv',low_memory=False)

In [70]:
trans_data.head()

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN
1,171812,576,930101,PRIJEM,VKLAD,900.0,900.0,NaN,NaN,NaN
2,207264,704,930101,PRIJEM,VKLAD,1000.0,1000.0,NaN,NaN,NaN
3,1117247,3818,930101,PRIJEM,VKLAD,600.0,600.0,NaN,NaN,NaN
4,579373,1972,930102,PRIJEM,VKLAD,400.0,400.0,NaN,NaN,NaN

In [72]:
trans_data.isna().sum()

trans_id           0
account_id         0
date               0
type               0
operation     183114
amount             0
balance            0
k_symbol      481881
bank          782812
account       760931
dtype: int64

In [73]:
def type_parse(x):
    if x == 'PRIJEM':
        return 'Credit'
    elif x == 'VYDAJ':
        return 'Withdrawal'
    else:
        return 'Unknown'

In [74]:
def operation_parse(x):
    if x == 'VYBER KARTOU':
        return 'Credit card withdrawal'
    elif x == 'VKLAD':
        return 'Credit in cash'
    elif x == 'PREVOD Z UCTU':
        return 'Collection from another bank'
    elif x == 'VYBER':
        return 'Withdrawal in Cash'
    elif x == 'PREVOD NA UCET':
        return 'Remittance to another bank'    
    else:
        return 'Unknown'

In [75]:
def k_symbom_parse(x):
    if x == 'POJISTNE':
        return 'Insurance payment'
    elif x == 'SLUZBY':
        return 'Payment for statement'
    elif x == 'UROK':
        return 'Interest credited'
    elif x == 'SANKC. UROK':
        return 'Sanction interest if negative balance'
    elif x == 'SIPO':
        return 'Household'
    elif x == 'DUCHOD':
        return 'Old-age pension'  
    elif x == 'UVER':
        return 'Loan payment'      
    else:
        return 'Unknown'

In [76]:
trans_data['trans_type'] = trans_data['type'].map(type_parse)
trans_data['trans_operation'] = trans_data['operation'].map(operation_parse)
trans_data['trans_k_symbol'] = trans_data['k_symbol'].map(k_symbom_parse)

In [79]:
trans_data = trans_data.drop(['k_symbol','operation','type'],axis=1)

In [81]:
trans_data['date'] = pd.to_datetime(trans_data['date'], format='%y%m%d')

In [83]:
trans_data= trans_data.set_index('trans_id')

In [85]:
trans_data = trans_data.rename(columns={'amount': 'trans_amount',
                              'balance':'balance_after_trans',
                              'bank':'trans_bank',
                              'account':'trans_account'})

In [86]:
trans_data.head()

,account_id,date,trans_amount,balance_after_trans,trans_bank,trans_account,trans_type,trans_operation,trans_k_symbol
trans_id,,,,,,,,,
695247,2378,1993-01-01,700.0,700.0,NaN,NaN,Credit,Credit in cash,Unknown
171812,576,1993-01-01,900.0,900.0,NaN,NaN,Credit,Credit in cash,Unknown
207264,704,1993-01-01,1000.0,1000.0,NaN,NaN,Credit,Credit in cash,Unknown
1117247,3818,1993-01-01,600.0,600.0,NaN,NaN,Credit,Credit in cash,Unknown
579373,1972,1993-01-02,400.0,400.0,NaN,NaN,Credit,Credit in cash,Unknown

In [87]:
trans_data.to_csv('dataset/cleanData/trans_data_cleaned.csv')